Abhi6310/STM32_Battleship/firmware/Core/Inc/GameDriver.h
#ifndef INC_GAMEDRIVER_H_
#define INC_GAMEDRIVER_H_

#include "stm32f4xx_hal.h"

typedef enum {
    STATE_HOME_SCREEN,
    STATE_P1_PLACEMENT,
    STATE_P2_PLACEMENT,
    STATE_AI_SETUP,
    STATE_P1_ATTACK,
    STATE_AI_ATTACK,
    STATE_P2_ATTACK,
    STATE_TRANSITION_SCREEN,
    STATE_GAME_OVER,
    STATE_STATS_SCREEN,
} GameState;

#define GRID_SIZE 7
#define NUM_SHIPS 3
#define DESTROYER_LENGTH 2
#define SUBMARINE_LENGTH 3
#define BATTLESHIP_LENGTH 4

typedef enum { CELL_EMPTY, CELL_SHIP, CELL_HIT, CELL_MISS, CELL_SUNK } CellState;

typedef struct {
    CellState cells[GRID_SIZE][GRID_SIZE];
} Grid;

uint8_t Touch_IsInGrid(uint16_t px, uint16_t py);
uint8_t Touch_ToGridRow(uint16_t py);
uint8_t Touch_ToGridCol(uint16_t px);

void GameDriver_Init(void);
void GameDriver_HandleTouch(uint16_t x, uint16_t y);
void GameDriver_HandleButtonTick(void);
void GameDriver_HandleTimerTick(void);
void GameDriver_ResetGame(void);
GameState GameDriver_GetState(void);

#endif /* INC_GAMEDRIVER_H_ */
